package main

import "fmt"

/*
Удалить i-ый элемент из слайса.
*/

func main() {
	//Слайсы
	a := []int{1, 2, 3, 4, 5, 6, 7, 8}
	b := []string{"A", "B", "C", "D", "E", "F"}
	//Индекс элемента для удаления
	i := 4
	fmt.Printf("Слайс номер 1: %d\nСлайс номер 2: %s\nИндекс удаляемого элемента: %d \n", a, b, i)

	firstWay(b, i)
	secondWay(a, i)
}

func firstWay(a []string, i int) {
	// копировать последний элемент в индекс i
	a[i] = a[len(a)-1]
	// удалить последний элемент (записать нулевое значение)
	a[len(a)-1] = ""
	//усечь срез
	a = a[:len(a)-1]
	fmt.Printf("Первый способ: %s\n", a)
}

func secondWay(a []int, i int) {
	//сдвиг a[i+1:] влево на один индекс
	copy(a[i:], a[i+1:])
	// удалить последний элемент (записать нулевое значение)
	a[len(a)-1] = 0
	//усечь срез
	a = a[:len(a)-1]
	fmt.Printf("Второй способ: %d\n", a)

}
